#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_secretsmanager_secret.secret: Reading...
aws_route53_zone.thomaskimble: Refreshing state... [id=Z0521747TTLHC74FLK9Z]
data.aws_secretsmanager_secret.secret: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D]
data.aws_secretsmanager_secret_version.current: Reading...
data.aws_secretsmanager_secret_version.current: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:287212251408:secret:ThomasOliverKimble-github-aws-access-token-Smhr9D|AWSCURRENT]
aws_amplify_app.thomaskimble_frontend: Refreshing state... [id=d2er6jry7l1se1]
aws_amplify_branch.main: Refreshing state... [id=d2er6jry7l1se1/main]
aws_amplify_branch.dev: Refreshing state... [id=d2er6jry7l1se1/dev]
aws_amplify_domain_association.thomaskimble: Refreshing state... [id=d2er6jry7l1se1/thomaskimble.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate.thomaskimble_certificate will be created
  + resource "aws_acm_certificate" "thomaskimble_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "thomaskimble.com"
      + domain_validation_options = [
          + {
              + domain_name           = "thomaskimble.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + key_algorithm             = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "thomaskimble.com",
        ]
      + tags_all                  = (known after apply)
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @ThomasOliverKimble, Action: `pull_request`*